## Staging: secrets
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                              NAME                              |
|--------|----------------------------------------------------------------|
| add    | `aws_secretsmanager_secret_version.zitadel_administration_key` |
|        | `aws_secretsmanager_secret_version.zitadel_provider`           |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_secretsmanager_secret_version.zitadel_administration_key will be created
  + resource "aws_secretsmanager_secret_version" "zitadel_administration_key" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:zitadel_administration_key-Oaki1d"
      + version_id     = (known after apply)
      + version_stages = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_secretsmanager_secret_version.zitadel_provider will be created
  + resource "aws_secretsmanager_secret_version" "zitadel_provider" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:zitadel_provider-ratQVc"
      + version_id     = (known after apply)
      + version_stages = (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + zitadel_administration_key_arn          = (known after apply)
  + zitadel_provider_secret_arn             = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.freshdesk_api_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.notify_api_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.notify_callback_bearer_token"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.recaptcha_secret"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.token_secret"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.zitadel_administration_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.zitadel_provider"]

26 tests, 19 passed, 7 warnings, 0 failures, 0 exceptions

```

</details>
